; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared0 - mode
	image1 - mode
	image2 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation1 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument1 infrared0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 image1)
	(calibration_target instrument3 Star4)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star15)
)
(:goal (and
	(pointing satellite2 Phenomenon13)
	(have_image Planet5 image1)
	(have_image Planet6 infrared0)
	(have_image Star7 image1)
	(have_image Star8 infrared0)
	(have_image Phenomenon9 image1)
	(have_image Phenomenon10 image2)
	(have_image Star11 image1)
	(have_image Phenomenon12 infrared0)
	(have_image Phenomenon13 image2)
	(have_image Star14 image2)
	(have_image Star15 image1)
	(have_image Phenomenon16 image1)
))

)

; plan
1. (turn_to satellite2 groundstation1 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 13
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 13
3. (calibrate satellite2 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 13
4. (turn_to satellite2 phenomenon9 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon9)
   goals met: 0 of 13
5. (take_image satellite2 phenomenon9 instrument2 image1)
   added: (have_image phenomenon9 image1)
   goals met: 1 of 13
6. (turn_to satellite2 phenomenon16 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon16)
   goals met: 1 of 13
7. (take_image satellite2 phenomenon16 instrument2 image1)
   added: (have_image phenomenon16 image1)
   goals met: 2 of 13
8. (turn_to satellite2 phenomenon10 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon10)
   goals met: 2 of 13
9. (turn_to satellite1 groundstation0 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 groundstation0)
   goals met: 2 of 13
10. (take_image satellite2 phenomenon10 instrument2 image2)
   added: (have_image phenomenon10 image2)
   goals met: 3 of 13
11. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 13
12. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 3 of 13
13. (turn_to satellite1 phenomenon12 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 13
14. (take_image satellite1 phenomenon12 instrument1 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 4 of 13
15. (turn_to satellite1 planet6 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet6)
   goals met: 4 of 13
16. (take_image satellite1 planet6 instrument1 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 5 of 13
17. (turn_to satellite1 star14 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star14)
   goals met: 5 of 13
18. (take_image satellite1 star14 instrument1 image2)
   added: (have_image star14 image2)
   goals met: 6 of 13
19. (turn_to satellite1 star8 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star8)
   goals met: 6 of 13
20. (take_image satellite1 star8 instrument1 infrared0)
   added: (have_image star8 infrared0)
   goals met: 7 of 13
21. (turn_to satellite2 planet5 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet5)
   goals met: 7 of 13
22. (take_image satellite2 planet5 instrument2 image1)
   added: (have_image planet5 image1)
   goals met: 8 of 13
23. (turn_to satellite2 star11 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star11)
   goals met: 8 of 13
24. (take_image satellite2 star11 instrument2 image1)
   added: (have_image star11 image1)
   goals met: 9 of 13
25. (turn_to satellite2 star15 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star15)
   goals met: 9 of 13
26. (take_image satellite2 star15 instrument2 image1)
   added: (have_image star15 image1)
   goals met: 10 of 13
27. (turn_to satellite2 star7 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star7)
   goals met: 10 of 13
28. (take_image satellite2 star7 instrument2 image1)
   added: (have_image star7 image1)
   goals met: 11 of 13
29. (turn_to satellite2 phenomenon13 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon13)
   goals met: 12 of 13
30. (take_image satellite2 phenomenon13 instrument2 image2)
   added: (have_image phenomenon13 image2)
   goals met: 13 of 13
